docuSign/tmp/RequestStatuses.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.docusign.net/API/3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><SOAP-ENV:Header><wsa:Action>http://www.docusign.net/API/3.0/RequestStatuses</wsa:Action><wsa:To>https://demo.docusign.net/api/3.0/api.asmx</wsa:To><wsa:MessageID>uudi:4e1eb21f-af1d-ec35-5153-64eeaa622f62</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2010-11-22T21:08:15Z</wsu:Created><wsu:Expires>2010-11-22T21:13:15Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken><wsse:Username>[TREE-b88ac21a-a6be-4bde-b342-c38933721a1e]397fae8a-af31-45e2-bc03-3db45039f255</wsse:Username><wsse:Password>Doc-4tron</wsse:Password><wsse:Nonce>PxewM0cubHQhaz2ws1nLMWj9QLwm4kKcVQ/4l90KDvU=</wsse:Nonce><wsu:Created xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2010-11-22T21:08:15Z</wsu:Created></wsse:UsernameToken></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:RequestStatuses><ns1:EnvelopeStatusFilter><ns1:UserInfo><ns1:UserName>Chris Zhang</ns1:UserName><ns1:Email>czhang@treenosoftware.com</ns1:Email></ns1:UserInfo><ns1:AccountId>40bedf24-70fd-4234-bf57-4263fa036605</ns1:AccountId><ns1:BeginDateTime xsi:nil="true"/><ns1:Statuses><ns1:Status>Any</ns1:Status></ns1:Statuses><ns1:EnvelopeIds><ns1:EnvelopeId>cfc0dee9-3825-4f40-81b5-1882d0e1b4d3</ns1:EnvelopeId></ns1:EnvelopeIds><ns1:StartAtIndex xsi:nil="true"/></ns1:EnvelopeStatusFilter></ns1:RequestStatuses></SOAP-ENV:Body></SOAP-ENV:Envelope>
